@@ -1,30 +1,10 @@
حزمة  كوم . سايبوزو . مختبرات . كشف . الموقع ؛

/ *
* حقوق الطبع والنشر (C) 2010-2014 Cybozu Labs، 2016 كونستانتين جوساروف
*
* مرخص بموجب ترخيص Apache، الإصدار 2.0 ("الترخيص")؛
* لا يجوز لك استخدام هذا الملف إلا بحكم الترخيص.
* يمكنك الحصول على نسخة من الخلفية
*
* http://www.apache.org/licenses/LICENSE-2.0
*
* ما لم يكن ذلك مطلوبًا بموجب القانون الأساسي به أو تم الاتفاق عليه كتابيًا
* موزعة بموجب نظام يتم توزيعها على أساس "كما هي"،
* بدون ضمانات أو شروط من أي نوع، سواء كانت صريحة أو ضمنية.
* راجع مرجع الأذونات المحددة و
*القيود بموجب النظام.
* /

غزاله  . _junit . مجرب ؛

استيراد  منظمة تقييد  . junit . بالتأكيد . بالتأكيد يساوي ;
استيراد  منظمة تقييد  . junit . بالتأكيد . بالتأكيدNull ؛

/**
*المؤلف ناكاتاني شويو
* @ المؤلف كونستانتين جوساروف
* /
 اللغة العربية  العامة LangProfileTest {
    @ تم اختباره
     الاختبار النهائي النهائي Add  ( ) { 
         ملف تعريف LangProfile  النهائي = new TestLangProfile ( new int []{ 0 , 0 , 0 });  
        الملف الشخصي . إضافة ( "أ" )؛
        AssurEquals ( 1 , ( int ) Profile . frequeency . get ( "a" ));
        الملف الشخصي . إضافة ( "أ" )؛
        AssurEquals ( 2 , ( int ) Profile . frequeency . get ( "a" ));
    }
    @ اختبار
     اختبار الفراغ النهائي  العام AddIllegally () { 
         ملف تعريف LangProfile  النهائي = new TestLangProfile ( new int []{ 0 , 0 , 0 });  
        الملف الشخصي . إضافة ( "أ" )؛
        الملف الشخصي . إضافة ( "" );
        الملف الشخصي . إضافة ( "ايه بي سي دي" )؛
        AssurEquals ( 1 , ( int ) Profile . frequeency . get ( "a" ));
        تأكيدNull ( الملف الشخصي . الترددات .get ( " " ));
        تأكيدNull ( الملف الشخصي . الترددات .get ( "abcd" ) );
    }
