@@ -1,21 +1,5 @@
حزمة  كوم . سايبوزو . مختبرات . لانغديتيكت .

/ *
* حقوق الطبع والنشر (C) 2010-2014 Cybozu Labs، 2016 كونستانتين جوساروف
*
* مرخص بموجب ترخيص Apache، الإصدار 2.0 ("الترخيص")؛
* لا يجوز لك استخدام هذا الملف إلا بحكم الترخيص.
* يمكنك الحصول على نسخة من الخلفية
*
* http://www.apache.org/licenses/LICENSE-2.0
*
* ما لم يكن ذلك مطلوبًا بموجب القانون الأساسي به أو تم الاتفاق عليه كتابيًا
* موزعة بموجب نظام يتم توزيعها على أساس "كما هي"،
* بدون ضمانات أو شروط من أي نوع، سواء كانت صريحة أو ضمنية.
* راجع مرجع الأذونات المحددة و
*القيود بموجب النظام.
* /

استيراد  كوم . سايبوزو . مختبرات . كشف . من حسن الحظ . لانغروفيل .
استيراد  كوم . fastxml . جاكسون . قاعدة بيانات . ObjectMapper .
غزاله  . _junit . قبل ؛
@@ -26,10 +10,6 @@

استيراد  منظمة تقييد  . junit . بالتأكيد . بالتأكيد يساوي ;

/**
*المؤلف ناكاتاني شويو
* @ المؤلف كونستانتين جوساروف
* /
 اختبار الكشف عن اللغة  اليابانية {
     السلسلة النهائية الخاصة TRAINING_EN = "aaabbccd e "  ؛  
     السلسلة النهائية الخاصة TRAINING_FR = "abbccccdd d "  ؛  
     السلسلة النهائية الثابتة  الخاصة TRAINING_JA = " \u3042 \u3042 \u3042 \u3044 \u3046 \u3048 \u3048 " ؛        
     سلسلة نهائية ثابتة  خاصة  PROFILE_TEMPLATE = " { \" name \" : \" %s \" , \" n_words \" : [0,0,0], \" freq \" : {}}" ; 
    كاشف خاص  مصنع كاشف المصنع  ;
    @ قبل
     إعداد الفراغ  العام () يطرح استثناء { 
        DetectorFactory = new  DetectorFactory ();
         مخطط ObjectMapper  النهائي = جديد ObjectMapper () ؛ 
        LangProfileDocument  lpd = معين . readValue ( تنسيق سلسلة ( PROFILE_TEMPLATE ، "en" )، LangProfileDocument . class ) ؛
        Final  LangProfile  en = new  LangProfile ( lpd ) ؛
        لـ ( السلسلة النهائية  w : TRAINING_EN . تقسيم ( "" )) { 
            أون . يضاف ( ث ) ؛
        }
        كاشف مصنع . addProfile ( en ، 0 ، 3 ) ؛
        lpd = مخطط . readValue ( تنسيق سلسلة ( PROFILE_TEMPLATE ، " fr" )، LangProfileDocument . class )؛
        نهائي  LangProfile  fr = new  LangProfile ( lpd ) ؛
        لـ ( السلسلة النهائية  w : TRAINING_FR . split ( "" )) { 
