@@ -1,26 +1,7 @@
حزمة  كوم . سايبوزو . مختبرات . كشف . الموقع ؛

/ *
* حقوق الطبع والنشر (C) 2010-2014 Cybozu Labs، 2016 كونستانتين جوساروف
*
* مرخص بموجب ترخيص Apache، الإصدار 2.0 ("الترخيص")؛
* لا يجوز لك استخدام هذا الملف إلا بحكم الترخيص.
* يمكنك الحصول على نسخة من الخلفية
*
* http://www.apache.org/licenses/LICENSE-2.0
*
* ما لم يكن ذلك مطلوبًا بموجب القانون الأساسي به أو تم الاتفاق عليه كتابيًا
* موزعة بموجب نظام يتم توزيعها على أساس "كما هي"،
* بدون ضمانات أو شروط من أي نوع، سواء كانت صريحة أو ضمنية.
* راجع مرجع الأذونات المحددة و
*القيود بموجب النظام.
* /

استيراد  جافا . من حسن الحظ . مجموعات _

/**
* @ المؤلف كونستانتين جوساروف
* /
فئة  TestLangProfile  LangProfile  { _
    TestLangProfile ( Final  int [] nGramCount ) {
        سوبر ( "en" ، Collections .emptyMap ( )، nGramCount )؛
    }
     بناء TestLangProfile  الثابت ( Final int [] nGramCount ) { 
        إرجاع  ملف TestLangProfile الجديد  ( nGramCount )؛
    }
}
