@@ -1,21 +1,5 @@
حزمة  كوم . سايبوزو . مختبرات . كشف . الموقع ؛

/ *
* حقوق الطبع والنشر (C) 2010-2014 Cybozu Labs، 2016 كونستانتين جوساروف
*
* مرخص بموجب ترخيص Apache، الإصدار 2.0 ("الترخيص")؛
* لا يجوز لك استخدام هذا الملف إلا بحكم الترخيص.
* يمكنك الحصول على نسخة من الخلفية
*
* http://www.apache.org/licenses/LICENSE-2.0
*
* ما لم يكن ذلك مطلوبًا بموجب القانون الأساسي به أو تم الاتفاق عليه كتابيًا
* موزعة بموجب نظام يتم توزيعها على أساس "كما هي"،
* بدون ضمانات أو شروط من أي نوع، سواء كانت صريحة أو ضمنية.
* راجع مرجع الأذونات المحددة و
*القيود بموجب النظام.
* /

غزاله  . _junit . مجرب ؛
غزاله  . _junit . عداء . مع تشغيل ؛
غزاله  . _junit . العدايين . معلمات _
@@ -25,10 +9,6 @@

استيراد  منظمة تقييد  . junit . بالتأكيد . بالتأكيد يساوي ;

/**
*المؤلف ناكاتاني شويو
* @ المؤلف كونستانتين جوساروف
* /
@ RunWith ( فئة ذات معلمات )
 اللغة الانجليزية النهائية  العامة NGramNormalizationTest { 
    @ المعلمة . المعلمات ( الاسم = "{index}: NGram.normalize" )
     المجموعة الثابتة  العامة < كائن []> البيانات () {
        عودة  المصفوفات . قائمة ( كائن جديد  []] {
                { '\u0000' , ' ' },
                { '\u0009' , ' ' },
                { '\u0020' , ' ' },
                { '\u0030' , ' ' },
                { '\u0040' , ' ' },
                { '\u0041' , '\u0041' },
                { '\u005a' , '\u005a' },
                { '\u005b' , ' ' },
                { '\u0060' , ' ' },
                { '\u0061' , '\u0061' },
                { '\u007a' , '\u007a' },
                { '\u007b' , ' ' },
                { '\u007f' , ' ' },
                { '\u0080' , '\u0080' },
                { '\u00a0' , ' ' },
                { '\u00a1' , '\u00a1' },
                { '\u4E00' , '\u4E00' },
                { '\u4E01' , '\u4E01' },
