@@ -1,21 +1,5 @@
حزمة  كوم . سايبوزو . مختبرات . كشف . الموقع ؛

/ *
* حقوق الطبع والنشر (C) 2010-2014 Cybozu Labs، 2016 كونستانتين جوساروف
*
* مرخص بموجب ترخيص Apache، الإصدار 2.0 ("الترخيص")؛
* لا يجوز لك استخدام هذا الملف إلا بحكم الترخيص.
* يمكنك الحصول على نسخة من الخلفية
*
* http://www.apache.org/licenses/LICENSE-2.0
*
* ما لم يكن ذلك مطلوبًا بموجب القانون الأساسي به أو تم الاتفاق عليه كتابيًا
* موزعة بموجب نظام يتم توزيعها على أساس "كما هي"،
* بدون ضمانات أو شروط من أي نوع، سواء كانت صريحة أو ضمنية.
* راجع مرجع الأذونات المحددة و
*القيود بموجب النظام.
* /

غزاله  . _junit . مجرب ؛
غزاله  . _junit . عداء . مع تشغيل ؛
غزاله  . _junit . العدايين . معلمات _
@@ -25,10 +9,6 @@

استيراد  منظمة تقييد  . junit . بالتأكيد . بالتأكيد يساوي ;

/**
*المؤلف ناكاتاني شويو
* @ المؤلف كونستانتين جوساروف
* /
@ RunWith ( فئة ذات معلمات )
 اللغة الانجليزية النهائية  العامة VientameseNGramNormalizationTest { 
    @ المعلمة . المعلمات ( الاسم = "{index}: NGram.normalizeVietnamese" )
     المجموعة الثابتة  العامة < كائن []> البيانات () {
        عودة  المصفوفات . قائمة ( كائن جديد  []] {
                { "" ، "" }،
                { "أي بي سي" ، "أي بي سي" }،
                { "012" ، "012" }،
                { " \u00c0 " , " \u00c0 " },
                { " \u0041 \u0300 " , " \u00C0 " },
                { " \u0045 \u0300 " ، " \u00C8 " }،
                { " \u0049 \u0300 " , " \u00CC " },
                { " \u004F \u0300 " , " \u00D2 " },
                { " \u0055 \u0300 " , " \u00D9 " },
                { " \u0059 \u0300 " ، " \u1EF2 " }،
                { " \u0061 \u0300 " , " \u00E0 " },
                { " \u0065 \u0300 " ، " \u00E8 " }،
                { " \u0069 \u0300 " ، " \u00EC " }،
                { " \u006F \u0300 " , " \u00F2 " },
                { " \u0075 \u0300 " ، " \u00F9 " }،
                { " \u0079 \u0300 " ، " \u1EF3 " }،
                { " \u00C2 \u0300 " ، " \u1EA6 " }،
